Revit 2026 API

# RenderingQuality Enumeration

---

Indicates the rendering quality in rendering settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RenderingQuality
```
```vb
Public Enumeration RenderingQuality
```
```cpp
public enum class RenderingQuality
```
```fsharp
type RenderingQuality
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 16 | Custom level quality. |
| Draft | 11 | Draft level quality. |
| High | 14 | High level quality. |
| Medium | 13 | Medium level quality. |
| VeryHigh | 15 | Very high level quality. |

#### Reference

Autodesk.Revit.DB Namespace